[
    {
      "id": "01",
      "rating":"5",
      "name": "C++",
      "price":"4K",
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/ISO_C%2B%2B_Logo.svg/1200px-ISO_C%2B%2B_Logo.svg.png",
      "description":"C++ is a general-purpose, object-oriented programming language that was designed by Bjarne Stroustrup in 1979 to be an extension of the C language. It has the features of imperative, object-oriented as well as generic programming models. C++ also has some additional facilities to those in C such as classes, inheritance, default function argument, etc. C++ plays quite an integral role in modern times as many contemporary systems such as operating systems, web browsers, databases, etc. have C++ code in at least some part of their codebase. Moreover, C++ is quite useful in performance-critical areas because of its speed."
    },
    {
      "id": "02",
      "rating":"4",
      "name": "JAVA",
      "price":"4K",
      "image_url":"https://dev.java/assets/images/java-logo-vert-blk.png",
      "description":"Java is a general-purpose, object-oriented programming language that was designed by James Gosling at Sun Microsystems in 1991. The compilation of the Java applications results in the bytecode that can be run on any platform using the Java Virtual Machine. Because of this, Java is also known as a WORA (Write Once, Run Anywhere) language. In modern times, Java is one of the most popular programming languages as it can be used to design customized applications that are light and fast and serve a variety of purposes. According to the TIOBE Index for April 2022, Java is among the top three programming languages."
    },
    {
      "id": "03",
      "rating":"4.5",
      "name": "JAVA SCRIPT",
      "price":"3K",
      "image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/2048px-Unofficial_JavaScript_logo_2.svg.png",
      "description":"JavaScript (JS) is very popular and adopted universally by every web browser for its support which allows dynamic content to get executed in a webpage. It's an object scripting language which is used in web pages along with markup language HTML. JavaScript does not incorporate or abide by any HTML tags or rules. It is similar to the stand-alone programming language developed by Sun Microsystems. JavaScript got its success worldwide with its integration into the web browsers. JS stands unique as it brings out all the special functionalities in the client’s browser instead of the site’s server."
    },
    {
      "id": "04",
      "rating":"5",
      "name": "PYTHON",
      "price":"4K",
      "image_url":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Python-logo-notext.svg/1200px-Python-logo-notext.svg.png",
      "description":"Python is an object-oriented and open-source language developed in the 1980s by Dutchman Guido van Rossum. Tech Giants like Cisco, IBM, Mozilla, Google, Quora, Hewlett-Packard, Dropbox, and Qualcomm are using this language owing to its simplicity and elegance. Most developers prefer Python over the plethora of programming languages out there because of its emphasis on readability and efficiency. "
    },
    {
      "id": "05",
      "rating":"5",
      "name": "HTML",
      "price":"1K",
      "image_url":"https://play-lh.googleusercontent.com/85WnuKkqDY4gf6tndeL4_Ng5vgRk7PTfmpI4vHMIosyq6XQ7ZGDXNtYG2s0b09kJMw",
      "description":"HTML is one of the most important aspects in website design that should be taken into consideration. HTML coding commands are very simple. In addition, various Internet browsers are designed to make HTML easy to read. Designing a website is not a very difficult task if one follows a systematic process. If the procedures are not followed, it may be more difficult than rocket science."
    },
    {
      "id": "06",
      "rating":"4",
      "name": "CSS",
      "price":"1K",
      "image_url":"https://cdn-icons-png.flaticon.com/512/919/919826.png",
      "description":"CSS is important because it controls all design-related aspects of your website. Typography, colours, page layouts and any other visual aspects of your website are all controlled by CSS. What's more, CSS allows you to control and adjust the design and formatting of your entire website (no matter how big or small it is) from a single spot. This is done using what's called an external style sheet."
    }
  ]